In [ ]:
conda install psycopg2

In [ ]:
import psycopg2
with psycopg2.connect(host="", user="", password="", dbname="sqlda2", port=5432) as conn:
    with conn.cursor() as cur:
        cur.execute("SELECT * FROM customers LIMIT 5")
        records = cur.fetchall()
records

In [7]:
from sqlalchemy import create_engine 
import pandas as pd

In [8]:
%matplotlib inline

In [ ]:
cnxn_string = ("postgresql+psycopg2://{username}:{pswd}" 
               "@{host}:{port}/{database}") 
print(cnxn_string)

In [10]:
engine = create_engine(cnxn_string.format( 
    username="", 
    pswd="", 
    host="",
    port=5432, 
    database="sqlda2"))

In [ ]:
engine.execute("SELECT * FROM customers LIMIT 2;").fetchall()

In [12]:
customers_data = pd.read_sql_table('customers', engine)

In [13]:
query = """
    SELECT city,
           COUNT(1) AS number_of_customers, 
           COUNT(NULLIF(gender, 'M')) AS female, 
           COUNT(NULLIF(gender, 'F')) AS male 
    FROM customers
    WHERE city IS NOT NULL
    GROUP BY 1
    ORDER BY 2 DESC 
    LIMIT 10
"""

In [ ]:
query

In [15]:
top_cities_data = pd.read_sql_query(query, engine)

In [16]:
top_cities_data

            city  number_of_customers  female  male
0     Washington                 1447     734   713
1        Houston                  904     446   458
2  New York City                  731     369   362
3        El Paso                  713     369   344
4         Dallas                  607     309   298
5        Atlanta                  571     292   279
6     Sacramento                  506     244   262
7    Los Angeles                  466     241   225
8    San Antonio                  426     207   219
9          Miami                  426     195   231

In [ ]:
ax = top_cities_data.plot.bar('city', y=['female', 'male'], title='Number of Customers by Gender and City')